# language: uk
Функціонал: Об'єднання користувачів у сім'ю
  Коли люди мають спільний бюджет, як це часто буває у сім'ях,
  Тоді зручніше бачити спільний баланс по витратам
  Для того, щоб не рахувати його самостійно

  Передумова:
    Припустимо, що я увійшов у систему
      І в мене є подія з користувачими Іра та Сергій

  Сценарій: Створення нової сім'ї
    Нехай я на сторінці створення нової сім'ї
      І я обираю користувачів Іра та Паша для нової сім'ї
      Та ввожу "Іра & Паша" як ім'я для нової сім'ї
    Коли я натисну "Зберегти" у формі створення сім'ї
    То маю побачити щойно створенну сім'ю "Іра & Паша" з корустувачами Іра та Паша


  Сценарій: Перегляд балансу сім'ї
    Припустимо, що я та Іра входимо до сім'ї "Іра & Паша"
      Та що існуює транзакція де Сергій заплатив за Іра 25
      А також я заплатив за Сергій 35
    Коли я відкрию сторінку балансу для цієї події
    То побачу наступний баланс:
      | Сергій     | -10.0 |
      | Іра & Паша | 10.0  |
