# language: uk
Функціонал: Об'єднання користувачів у сім'ю
  Коли люди мають спільний бюджет, як це часто буває у сім'ях,
  Тоді зручніше бачити спільний баланс по витратам
  Для того, щоб не рахувати його самостійно

  Передумова:
    Припустимо, що я увійшов у систему

  Сценарій: Створення нової сім'ї

  Сценарій: Перегляд балансу сім'ї
    Припустимо, що в мене є подія з користувачими Іра та Сергій
      І що я та Іра входимо до сім'ї "Іра & Паша"
      Та що існуює транзакція де Сергій заплатив за Іра 25
      А також я заплатив за Сергій 35
    Коли я відкрию сторінку балансу для цієї події
    То побачу наступний баланс:
      | Сергій    | -10.0 |
      | Іра & Паша| 10.0  |
