# language: uk
Функціонал: Реєстрація

  Сценарій: реєстрація за допомогою email та паролю
    Припустимо, що гість вирішив зареєструватись за допомогою email та паролю
    Коли він відправить свої дані для реєстрації
    То має отримати лист з привітанням про успішну реєстрацію
      Та має опинитися в середині системи

  Сценарій: авторизація за допомогою email та паролю
    Припустимо, що користувач вже зареєстрований у системі
    Коли він відправить свої дані для авторизації
    То має опинитися в середині системи

  Сценарій: відновлення паролю
    Припустимо, що користувач вже зареєстрований у системі
    Якщо він скористався можливістю відновити пароль
    То має отримати лист з інструкціями по відновленню паролю

