# language: uk
Функціонал: Створення події
  Коли користувач хоче відслідковувати взаємні розрахунки з певними людьми
  Він хоче створити для цього подію та запросити до неї учасників
  Для того щоб трати та баланс бачили лише учасники цієї події

  Сценарій: не авторизований користувач
    Коли я спробую створити подію
    То маю побачити сторінку авторизації

  Сценарій: успішне створення події
    Припустимо, що я увійшов у систему
    Коли я створю подію з вірними даними
    Тоді я зможу її побачити